{
  "title": "LEGO Star Wars Millennium Falcon",
  "price": 199.99,
  "discountPercentage": 10,
  "description": "Build and play with a legendary Star Wars starship! This LEGO Star Wars version of the Millennium Falcon is crammed with authentic details, features and characters. It has rotating top and bottom laser turrets, spring-loaded shooters, a lowering ramp and an opening cockpit. This set also comes with 7 minifigures and a D-O droid to recreate scenes from the Rise of Skywalker movie.",
  "category": "toys",
  "rating": 4.8,
  "thumbnail": "https://rukminim1.flixcart.com/image/850/1000/k1jlyfk0/block-construction/k/w/e/millennium-falcon-building-blocks-for-kids-1351-pcs-75257-lego-original-imafh3mwftfnywqm.jpeg?q=20"
}

{
  "title": "Monopoly Classic Game",
  "price": 19.99,
  "discountPercentage": 0,
  "description": "The Monopoly Classic Game is the original and best-selling board game of all time. It lets you buy, sell, and trade properties, build houses and hotels, and collect rent from your opponents. You can choose from eight different tokens, including the iconic hat, dog, and car. The game also features a speed die for faster gameplay and a bank card to keep track of your money. The Monopoly Classic Game is fun for the whole family.",
  "category": "toys",
  "rating": 4.8,
  "thumbnail": "https://www.hasbro.com/common/productimages/en_IN/7EABAF9750569047F5778F4663C79E75/6391588b30a50c012b79797c4735b2ebff9dae7b.jpg"
}

{
  "title": "Hot Wheels Ultimate Garage",
  "price": 99.99,
  "discountPercentage": 0,
  "description": "The Hot Wheels Ultimate Garage is the biggest Hot Wheels playset ever. It has parking space for over 100 cars, a massive jet plane, a giant shark, a car wash, a tune-up shop, and a race track. You can launch your cars from the top of the garage and watch them speed down the ramps, avoid the shark's jaws, and land in the winner's circle. The Ultimate Garage also connects to other Hot Wheels sets for endless possibilities.",
  "category": "toys",
  "rating": 4.7,
  "thumbnail": "https://images-cdn.ubuy.co.in/633b5f6aa34b3b7ca9143d8b-hot-wheels-super-ultimate-garage-playset.jpg"
}

{
  "title": "Barbie Dreamhouse",
  "price": 199.00,
  "discountPercentage": 20,
  "description": "The Barbie Dreamhouse is the ultimate dollhouse for Barbie and her friends. It has three stories, eight rooms, a working elevator, a pool with a slide, and over 70 accessories to play with. The Dreamhouse also features lights, sounds, and smart accessories that interact with the Barbie app. You can customize the rooms, design your own stories, and explore the world of Barbie with this amazing playset.",
  "category": "toys",
  "rating": 4.6,
  "thumbnail": "https://image.smythstoys.com/original/desktop/223900.jpg"
}

{
  "title": "IKEA EKTORP Sofa",
  "price": 399.00,
  "discountPercentage": 0,
  "description": "The IKEA EKTORP Sofa is a comfortable and durable sofa that comes in various colors and covers. It has a classic design that fits any living room style. The sofa has reversible seat cushions, removable and washable covers, and a 10-year limited warranty. The EKTORP Sofa is easy to assemble and care for.",
  "category": "furniture",
  "rating": 4.5,
  "thumbnail": "https://www.ikea.com/in/en/images/products/ektorp-2-seat-sofa-remmarn-light-grey__0818544_pe774475_s5.jpg"
}

{
  "title": "Sauder Edge Water Lift-Top Coffee Table",
  "price": 149.99,
  "discountPercentage": 25,
  "description": "The Sauder Edge Water Lift-Top Coffee Table is a versatile and functional piece of furniture that adds style and convenience to your living room. The table has a lift-top mechanism that allows you to raise the surface and use it as a work or dining space. The table also has hidden storage compartments, open shelves, and metal hardware. The table is made of engineered wood with a black finish.",
  "category": "furniture",
  "rating": 4.4,
  "thumbnail": "https://m.media-amazon.com/images/I/71WX9yAkEFL.jpg"
}

{
  "title": "Zinus Shalini Upholstered Platform Bed Frame",
  "price": 249.00,
  "discountPercentage": 0,
  "description": "The Zinus Shalini Upholstered Platform Bed Frame is a stylish and comfortable bed frame that supports any standard mattress. The frame has a sturdy steel structure, a wooden slat system, and a padded headboard with button tufting. The frame is easy to assemble and comes with all the tools and instructions needed. The frame also has a 5-year limited warranty.",
  "category": "furniture",
  "rating": 4.7,
  "thumbnail": "https://m.media-amazon.com/images/I/81r1GEdPWbL._AC_UF1000,1000_QL80_DpWeblab_.jpg"
}

{
  "title": "Furinno Simplistic End Table",
  "price": 19.99,
  "discountPercentage": 0,
  "description": "The Furinno Simplistic End Table is a simple and compact end table that fits any space and budget. The table has a durable and easy-to-clean surface, a lower shelf for storage or display, and four legs with plastic foot pads. The table is made of composite wood with a dark walnut finish. The table is easy to assemble and comes with the necessary hardware.",
  "category": "furniture",
  "rating": 4.3,
  "thumbnail": "https://m.media-amazon.com/images/I/71T-btJHA4L._AC_UF894,1000_QL80_DpWeblab_.jpg"
}

{
  "title": "Samsung 28 cu. ft. 4-Door French Door Refrigerator with FlexZone Drawer",
  "price": 2699.00,
  "discountPercentage": 10,
  "description": "The Samsung 28 cu. ft. 4-Door French Door Refrigerator with FlexZone Drawer is a smart and spacious refrigerator that keeps your food fresh and organized. The refrigerator has a FlexZone drawer that can be customized to four different temperature settings, a Twin Cooling Plus system that maintains optimal humidity levels, and a Wi-Fi enabled Family Hub that lets you stream music, watch TV, and manage your groceries on a touchscreen. The refrigerator also has a fingerprint-resistant stainless steel finish, an ice and water dispenser, and adjustable shelves and bins.",
  "category": "appliances",
  "rating": 4.6,
  "thumbnail": "https://image-us.samsung.com/SamsungUS/home/home-appliances/refrigerators/4-door-french-door/pdp/rf24r7201sr-aa/gallery/01-7201-stainless-022019.jpg"
}

{
  "title": "LG 4.5 cu. ft. High Efficiency Ultra Large Smart Front Load Washer",
  "price": 899.00,
  "discountPercentage": 0,
  "description": "The LG 4.5 cu. ft. High Efficiency Ultra Large Smart Front Load Washer is a powerful and smart washer that cleans your clothes efficiently and conveniently. The washer has a TurboWash 360 technology that uses five jets to spray water from multiple angles, a ColdWash option that saves energy while delivering the same performance as warm water, and a Wi-Fi enabled ThinQ app that lets you control and monitor your washer from anywhere. The washer also has a stainless steel drum, a steam function, and a 10-year limited warranty.",
  "category": "appliances",
  "rating": 4.7,
  "thumbnail": "https://images-cdn.ubuy.co.in/63596d87f180433d236e4047-lg-wm4000hwa-4-5-cu-ft-ultra-large.jpg"
}

{
  "title": "GE 1.1 cu. ft. Countertop Microwave Oven",
  "price": 99.00,
  "discountPercentage": 0,
  "description": "The GE 1.1 cu. ft. Countertop Microwave Oven is a compact and convenient microwave oven that fits any kitchen space. The microwave oven has a turntable that rotates food for even cooking, a power level control that allows you to adjust the cooking power, and a timer and clock that display the cooking time and the current time. The microwave oven also has a child lock feature, a defrost function, and a one-touch cooking option for popcorn, pizza, and beverages.",
  "category": "appliances",
  "rating": 4.4,
  "thumbnail": "https://scene7.samsclub.com/is/image/samsclub/0008469185736_B?wid=400&hei=400"
}

{
  "title": "Dyson V11 Torque Drive Cordless Stick Vacuum Cleaner",
  "price": 599.99,
  "discountPercentage": 0,
  "description": "The Dyson V11 Torque Drive Cordless Stick Vacuum Cleaner is a powerful and versatile vacuum cleaner that adapts to any floor type and cleans up any mess. The vacuum cleaner has a torque drive cleaner head that automatically adjusts the suction power, a digital motor that delivers up to 60 minutes of fade-free run time, and an LCD screen that shows the battery level, performance mode, and maintenance alerts. The vacuum cleaner also has a whole-machine filtration system, a hygienic bin emptying mechanism, and a variety of attachments for different cleaning tasks.",
  "category": "appliances",
  "rating": 4.8,
  "thumbnail": "https://m.media-amazon.com/images/I/61JLfnjlxTL._SL1500_.jpg"
}
